; domain
(define (domain overcooked)
  (:requirements :adl :typing :equality)
  (:types
    location - object ; Locations of objects and the agent
    food receptacle tool - item ; Objects that can be held and moved
    appliance - object ; Appliances that can be used to combine or cook food
    ftype rtype ttype atype - type ; Food, receptacle, tool and appliance types
    prepare-method combine-method cook-method - method ; Methods for cooking, etc
  )
  (:predicates
    ;; Static predicates

    ; Whether food ingredient ?f is of type ?ty
    (food-type ?ty - ftype ?f - food)
    ; Whether receptacle ?r is of type ?ty
    (receptacle-type ?ty - rtype ?r - receptacle)
    ; Whether tool ?t is of type ?ty
    (tool-type ?ty - ttype ?t - tool)
    ; Whether appliance ?a has type ?ty
    (appliance-type ?ty - atype ?a - appliance)

    ; Whether ?r-typed receptacle and ?t-typed tool can prepare via method ?m
    (has-prepare-method ?m - prepare-method ?r - rtype ?t - ttype)
    ; Whether ?r-typed receptacle and ?a-typed appliance can combine via method ?m
    (has-combine-method ?m - combine-method ?r - rtype ?a - atype)
    ; Whether ?r-typed receptacle and ?a-typed appliance can cook via method ?m
    (has-cook-method ?m - cook-method ?r - rtype ?a - atype)

    ;; Dynamic predicates

    ; Whether agent is at location ?l
    (agent-at-loc ?l - location)
    ; Whether object is at location ?l
    (object-at-loc ?o - object ?l - location)

    ; Whether the agent is not holding anything
    (handempty)
    ; Whether the agent is holding item ?i
    (holding ?i - item)

    ; Whether food item ?i is in or on receptacle ?r
    (in-receptacle ?i - food ?r - receptacle)
    ; Whether item ?i is in or on appliance ?a
    (in-appliance ?i - item ?a - appliance)
    ; Whether appliance ?a is occupied
    (occupied ?a - appliance)

    ; Whether food item ?f is prepared
    (is-prepared ?f - food)
    ; Whether food item ?f was prepared using method ?m
    (prepared ?m - prepare-method ?f - food)

    ; Whether food item ?f is combined
    (is-combined ?f - food)
    ; Whether food item ?f was combined using method ?m
    (combined ?m - combine-method ?f - food)
    ; Whether food items ?f1 and ?f2 were combined together using method ?m
    (combined-with ?m - combine-method ?f1 ?f2 - food)

    ; Whether food item ?f is cooked
    (is-cooked ?f - food)
    ; Whether food item ?f was cooked using method ?m
    (cooked ?m - cook-method ?f - food)
    ; Whether food items ?f1 and ?f2 were cooked together using method ?m
    (cooked-with ?m - cook-method ?f1 ?f2 - food)
  )

  ; Move from location ?l1 to location ?l2
  (:action move
   :parameters (?l1 ?l2 - location)
   :precondition (agent-at-loc ?l1)
   :effect (and (agent-at-loc ?l2) (not (agent-at-loc ?l1)))
  )

  ; Pick up item ?i at location ?l
  (:action pick-up
   :parameters (?i - item ?l - location)
   :precondition (and (handempty) (agent-at-loc ?l) (object-at-loc ?i ?l))
   :effect (and (holding ?i) (not (object-at-loc ?i ?l)) (not (handempty))
                (forall (?a - appliance)
                        (when (object-at-loc ?a ?l)
                              (and (not (occupied ?a))
                                   (not (in-appliance ?i ?a))))))
  )

  ; Put down item ?i at location ?l
  (:action put-down
   :parameters (?i - item ?l - location)
   :precondition (and (agent-at-loc ?l) (holding ?i)
                      (forall (?a - appliance)
                              (imply (object-at-loc ?a ?l) (not (occupied ?a)))))
   :effect (and (handempty) (object-at-loc ?i ?l) (not (holding ?i))
                (forall (?a - appliance)
                        (when (object-at-loc ?a ?l)
                              (and (occupied ?a) (in-appliance ?i ?a)))))
  )

  ; Take out food item ?i in receptacle ?r at location ?l
  (:action take-out
   :parameters (?i - food ?r - receptacle ?l - location)
   :precondition (and (handempty) (in-receptacle ?i ?r)
                      (agent-at-loc ?l) (object-at-loc ?r ?l)
                      (not (is-combined ?i)) (not (is-cooked ?i)))
   :effect (and (holding ?i) (not (in-receptacle ?i ?r)) (not (handempty)))
  )

  ; Place food item ?i in receptacle ?r at location ?l
  (:action place-in
   :parameters (?i - food ?r - receptacle ?l - location)
   :precondition (and (holding ?i) (agent-at-loc ?l) (object-at-loc ?r ?l))
   :effect (and (handempty) (in-receptacle ?i ?r) (not (holding ?i)))
  )

  ; Transfer all items in held receptacle ?src to receptacle ?dst at location ?l
  (:action transfer
   :parameters (?src ?dst - receptacle ?l - location)
   :precondition (and (holding ?src) (agent-at-loc ?l) (object-at-loc ?dst ?l)
                      (not (= ?src ?dst)))
   :effect (forall (?i - food)
                   (when (in-receptacle ?i ?src)
                         (and (in-receptacle ?i ?dst)
                              (not (in-receptacle ?i ?src)))))
  )

  ; Prepare a piece of food ?f in receptacle ?r using tool ?t via method ?m
  (:action prepare
   :parameters (?m - prepare-method ?r - receptacle ?t - tool
                ?f - food ?l - location)
   :precondition (and (holding ?t) (in-receptacle ?f ?r)
                      (agent-at-loc ?l) (object-at-loc ?r ?l)
                      (not (is-prepared ?f)) (not (is-combined ?f))
                      (not (is-cooked ?f))
                      (exists (?rt - rtype ?tt - ttype)
                              (and (receptacle-type ?rt ?r)
                                   (tool-type ?tt ?t)
                                   (has-prepare-method ?m ?rt ?tt))))
   :effect (and (is-prepared ?f) (prepared ?m ?f))
  )

  ; Combine ingredients in receptacle ?r using appliance ?a via method ?m
  (:action combine
   :parameters (?m - combine-method ?r - receptacle ?a - appliance ?l - location)
   :precondition (and (in-appliance ?r ?a)
                      (agent-at-loc ?l) (object-at-loc ?a ?l)
                      (exists (?rt - rtype ?at - atype)
                              (and (receptacle-type ?rt ?r)
                                   (appliance-type ?at ?a)
                                   (has-combine-method ?m ?rt ?at)))
                      (forall (?f - food)
                              (imply (in-receptacle ?f ?r)
                                     (and (not (is-combined ?f))
                                           (not (is-cooked ?f))))))
   :effect (forall (?f - food)
                    (when (in-receptacle ?f ?r)
                          (and (is-combined ?f) (combined ?m ?f)
                              (forall (?f2 - food)
                                      (when (and (in-receptacle ?f2 ?r)
                                                 (not (= ?f ?f2)))
                                            (combined-with ?m ?f ?f2))))))
  )

  ; Cook ingredients in receptacle ?r using appliance ?a via method ?m
  (:action cook
   :parameters (?m - cook-method ?r - receptacle ?a - appliance ?l - location)
   :precondition (and (in-appliance ?r ?a)
                      (agent-at-loc ?l) (object-at-loc ?a ?l)
                      (exists (?rt - rtype ?at - atype)
                              (and (receptacle-type ?rt ?r)
                                   (appliance-type ?at ?a)
                                   (has-cook-method ?m ?rt ?at)))
                      (forall (?f - food)
                              (imply (in-receptacle ?f ?r)
                                     (not (is-cooked ?f)))))
   :effect (forall (?f - food)
                    (when (in-receptacle ?f ?r)
                          (and (is-cooked ?f) (cooked ?m ?f)
                               (forall (?f2 - food)
                                       (when (and (in-receptacle ?f2 ?r)
                                                  (not (= ?f ?f2)))
                                             (cooked-with ?m ?f ?f2))))))
  )

)

; problem
;Patisserie/Bakery with honey cakes and donuts as a goal
(define (problem overcooked-problem-5)
	(:domain overcooked)
	;add plate
	(:objects
		egg honey flour chocolate strawberry watermelon grape apple peach orange ice milk - ftype ; Food types
		blender-jug glass basket mixing-bowl chopping-board plate - rtype ; Receptacle types
		blender oven deep-fryer mixer - atype ; Appliance types
		knife - ttype ; Tool types
		slice - prepare-method ; Preparation methods
		blend mix - combine-method ; Combine methods
		bake deep-fry - cook-method ; Cooking methods
		egg1 honey1 flour1 chocolate1 strawberry1 watermelon1 grape1 apple1 peach1 orange1 ice1 milk1 - food ; Food objects
		blender-jug1 glass1 basket1 mixing-bowl1 board1 plate1 - receptacle ; Receptacle objects
		blender1 oven1 fryer1 mixer1 - appliance ; Appliance objects
		knife1 - tool ; Tool objects
		start-loc food-loc blend-loc oven-loc fryer-loc glass-loc mix-loc board-loc plate-loc - location ; Locations
	)
	(:init
		; Type declarations
		(food-type honey honey1)
		(food-type flour flour1)
		(food-type ice ice1)
		(food-type egg egg1)
		(food-type chocolate chocolate1)
		(food-type strawberry strawberry1)
		(food-type watermelon watermelon1)
		(food-type orange orange1)
		(food-type peach peach1)
		(food-type grape grape1)
		(food-type apple apple1)
		(food-type milk milk1)
		(tool-type knife knife1)
		(receptacle-type blender-jug blender-jug1)
		(receptacle-type glass glass1)
		(receptacle-type basket basket1)
		(receptacle-type mixing-bowl mixing-bowl1)
		(receptacle-type chopping-board board1)
		(receptacle-type plate plate1)
		(appliance-type oven oven1)
		(appliance-type deep-fryer fryer1)
		(appliance-type blender blender1)
		(appliance-type mixer mixer1)
		; Method declarations
		(has-prepare-method slice chopping-board knife)
		(has-combine-method mix mixing-bowl mixer)
		(has-combine-method blend blender-jug blender)
		(has-cook-method deep-fry basket deep-fryer)
		; Initial agent state
		(handempty)
		(agent-at-loc start-loc)
		; Initial food locations
		(object-at-loc ice1 food-loc)
		(object-at-loc milk1 food-loc)
		(object-at-loc honey1 food-loc)
		(object-at-loc flour1 food-loc)
		(object-at-loc egg1 food-loc)
		(object-at-loc chocolate1 food-loc)
		(object-at-loc strawberry1 food-loc)
		(object-at-loc watermelon1 food-loc)
		(object-at-loc grape1 food-loc)
		(object-at-loc apple1 food-loc)
		(object-at-loc peach1 food-loc)
		(object-at-loc orange1 food-loc)
		; Receptacle, tool, and appliance locations
		(object-at-loc blender1 blend-loc)
		(object-at-loc blender-jug1 blend-loc)
		(object-at-loc basket1 fryer-loc)
		(object-at-loc oven1 oven-loc)
		(object-at-loc glass1 glass-loc)
		(object-at-loc fryer1 fryer-loc)
		(object-at-loc board1 board-loc)
		(object-at-loc plate1 plate-loc)
		; Whether receptacles are located on appliances
		(in-appliance blender-jug1 blender1)
		(in-appliance basket1 fryer1)
		(in-appliance mixing-bowl1 mixer1)
		(occupied mixer1)
		(occupied blender1)
		(occupied fryer1)
	)
	(:goal
	(exists (?ice - food ?chocolate - food ?milk - food ?glass - receptacle)
        (and (food-type ice ?ice)
             (food-type milk ?milk)
             (food-type chocolate ?chocolate)
			 (receptacle-type glass ?glass)
             (combined-with blend ?ice ?milk)
             (combined-with blend ?milk ?chocolate)
             (in-receptacle ?ice ?glass)
             (in-receptacle ?chocolate ?glass)
             (in-receptacle ?milk ?glass)))
	)
)

; plan
1. (move start-loc food-loc)
   deleted: (agent-at-loc start-loc)
   added: (agent-at-loc food-loc)
   goals met: 0 of 1
2. (pick-up ice1 food-loc)
   deleted: (object-at-loc ice1 food-loc) (handempty)
   added: (holding ice1)
   goals met: 0 of 1
3. (move food-loc blend-loc)
   deleted: (agent-at-loc food-loc)
   added: (agent-at-loc blend-loc)
   goals met: 0 of 1
4. (place-in ice1 blender-jug1 blend-loc)
   deleted: (holding ice1)
   added: (handempty) (in-receptacle ice1 blender-jug1)
   goals met: 0 of 1
5. (move blend-loc food-loc)
   deleted: (agent-at-loc blend-loc)
   added: (agent-at-loc food-loc)
   goals met: 0 of 1
6. (pick-up chocolate1 food-loc)
   deleted: (object-at-loc chocolate1 food-loc) (handempty)
   added: (holding chocolate1)
   goals met: 0 of 1
7. (move food-loc blend-loc)
   deleted: (agent-at-loc food-loc)
   added: (agent-at-loc blend-loc)
   goals met: 0 of 1
8. (place-in chocolate1 blender-jug1 blend-loc)
   deleted: (holding chocolate1)
   added: (handempty) (in-receptacle chocolate1 blender-jug1)
   goals met: 0 of 1
9. (move blend-loc food-loc)
   deleted: (agent-at-loc blend-loc)
   added: (agent-at-loc food-loc)
   goals met: 0 of 1
10. (pick-up milk1 food-loc)
   deleted: (object-at-loc milk1 food-loc) (handempty)
   added: (holding milk1)
   goals met: 0 of 1
11. (move food-loc blend-loc)
   deleted: (agent-at-loc food-loc)
   added: (agent-at-loc blend-loc)
   goals met: 0 of 1
12. (place-in milk1 blender-jug1 blend-loc)
   deleted: (holding milk1)
   added: (handempty) (in-receptacle milk1 blender-jug1)
   goals met: 0 of 1
13. (combine blend blender-jug1 blender1 blend-loc)
   added: (is-combined chocolate1) (combined blend chocolate1) (combined-with blend chocolate1 ice1) (combined-with blend chocolate1 milk1) (is-combined ice1) (combined blend ice1) (combined-with blend ice1 chocolate1) (combined-with blend ice1 milk1) (is-combined milk1) (combined blend milk1) (combined-with blend milk1 chocolate1) (combined-with blend milk1 ice1)
   goals met: 0 of 1
14. (pick-up blender-jug1 blend-loc)
   deleted: (object-at-loc blender-jug1 blend-loc) (handempty) (occupied blender1) (in-appliance blender-jug1 blender1)
   added: (holding blender-jug1)
   goals met: 0 of 1
15. (move blend-loc glass-loc)
   deleted: (agent-at-loc blend-loc)
   added: (agent-at-loc glass-loc)
   goals met: 0 of 1
16. (transfer blender-jug1 glass1 glass-loc)
   deleted: (in-receptacle chocolate1 blender-jug1) (in-receptacle ice1 blender-jug1) (in-receptacle milk1 blender-jug1)
   added: (in-receptacle chocolate1 glass1) (in-receptacle ice1 glass1) (in-receptacle milk1 glass1)
   goals met: 1 of 1
